# Pandas

## Pandas Series

In [172]:
import numpy as np
import pandas as pd
import seaborn as sns

In [173]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [174]:
series = pd.Series([1,2,3,4])
type(series)

pandas.core.series.Series

In [175]:
series.axes

[RangeIndex(start=0, stop=4, step=1)]

In [176]:
series.dtype

dtype('int64')

In [177]:
series.empty

False

In [178]:
series.ndim

1

In [179]:
series.size

4

In [180]:
series.values

array([1, 2, 3, 4], dtype=int64)

In [181]:
series[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [182]:
series.head(2)

0    1
1    2
dtype: int64

In [183]:
series.tail(2)

2    3
3    4
dtype: int64

In [184]:
a=np.array([1,2,3,55,77,888])
a

array([  1,   2,   3,  55,  77, 888])

In [185]:
series = pd.Series(a)
series

0      1
1      2
2      3
3     55
4     77
5    888
dtype: int32

In [186]:
series.index

RangeIndex(start=0, stop=6, step=1)

In [187]:
pd.Series([1,5,0.8,34], index=[1,3,5,7])

1     1.0
3     5.0
5     0.8
7    34.0
dtype: float64

In [188]:
series = pd.Series([1,2,3,66,88,9,0.3], index=['a','b','c','d','e','f','g'])

In [189]:
series['g']

0.3

In [190]:
dictionary = {'reg':10, 'log':11, 'cart':12}
dictionary

{'reg': 10, 'log': 11, 'cart': 12}

In [191]:
series =pd.Series(dictionary)

In [192]:
series['reg']

10

In [193]:
series['log':'cart']

log     11
cart    12
dtype: int64

In [194]:
pd.concat([series,series])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [195]:
series.append(series)

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [196]:
series

reg     10
log     11
cart    12
dtype: int64

## Index Operations

In [197]:
series = pd.Series([1,2,3,4,5,66,77])
series

0     1
1     2
2     3
3     4
4     5
5    66
6    77
dtype: int64

In [198]:
series.keys

<bound method Series.keys of 0     1
1     2
2     3
3     4
4     5
5    66
6    77
dtype: int64>

In [199]:
list(series.items())

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 66), (6, 77)]

In [200]:
series.values

array([ 1,  2,  3,  4,  5, 66, 77], dtype=int64)

In [201]:
5 in series

True

In [202]:
series[[4,5]]

4     5
5    66
dtype: int64

In [203]:
series =pd.Series(dictionary)
series

reg     10
log     11
cart    12
dtype: int64

In [204]:
series['reg':'cart']

reg     10
log     11
cart    12
dtype: int64

In [205]:
series[(series>10) & (series<12)]

log    11
dtype: int64

In [206]:
data = pd.Series(['a','b','c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [207]:
data[1] # data[0] will gives error

'a'

In [208]:
data[0:3]

1    a
3    b
5    c
dtype: object

In [209]:
data.loc[5]

'c'

In [210]:
data.loc[0:4] # label based indexing location

1    a
3    b
dtype: object

In [211]:
data.iloc[0] # positional indexing, iloc , catch by resetting index

'a'

## Pandas Dataframe

In [212]:
l = [1,4,577,343]
l

[1, 4, 577, 343]

In [213]:
data = pd.DataFrame(l, columns=['values'])
type(data)

pandas.core.frame.DataFrame

In [214]:
data.axes

[RangeIndex(start=0, stop=4, step=1), Index(['values'], dtype='object')]

In [215]:
data.shape

(4, 1)

In [216]:
data.ndim

2

In [217]:
data.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [218]:
data.head(2)

   values
0       1
1       4

In [219]:
data.tail(2)

   values
2     577
3     343

In [220]:
a=np.array([1,2,3,4,566])
type(a)

numpy.ndarray

In [221]:
pd.DataFrame(a,columns=['values'])

   values
0       1
1       2
2       3
3       4
4     566

In [222]:
v = np.arange(1,10).reshape(3,3)
v

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [223]:
data=pd.DataFrame(v,columns=['v1','v2','v3'])
data

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [224]:
data.columns=('value1','value2','value3')
data

   value1  value2  value3
0       1       2       3
1       4       5       6
2       7       8       9

In [225]:
data=pd.DataFrame(v,columns=['v1','v2','v3'], index=['a','b','c'])
data

   v1  v2  v3
a   1   2   3
b   4   5   6
c   7   8   9

In [226]:
pd.DataFrame(pd.Series([1,2,3,4]),columns=['variable'])

   variable
0         1
1         2
2         3
3         4

In [227]:
a = pd.Series([1,2,3,4])
b = pd.Series([1,2,3,4])

In [228]:
pd.DataFrame({'variable1':a,
              'variable2':b})

   variable1  variable2
0          1          1
1          2          2
2          3          3
3          4          4

In [229]:
dict_ = {
    'reg':{'RMSE':101,
           'MSE':111,
           'SSE':121},
    'log':{'RMSE':102,
           'MSE':112,
           'SSE':122},
    'cart':{'RMSE':103,
           'MSE':113,
           'SSE':123},
}

In [230]:
pd.DataFrame(dict_)

      reg  log  cart
RMSE  101  102   103
MSE   111  112   113
SSE   121  122   123

In [231]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)
df = pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     4     5     2
1     8     8     6
2     9     6     6
3     1     9     4
4     4     7     2

In [232]:
df[0:1]

   var1  var2  var3
0     4     5     2

In [233]:
df.index=['a','b','c','d','e']

In [234]:
df['c':'e']

   var1  var2  var3
c     9     6     6
d     1     9     4
e     4     7     2

In [235]:
df.drop('a', axis=0, inplace=True)

In [236]:
df

   var1  var2  var3
b     8     8     6
c     9     6     6
d     1     9     4
e     4     7     2

In [237]:
l = ['b','c']

In [238]:
l

['b', 'c']

In [239]:
df.drop(l,axis=0)

   var1  var2  var3
d     1     9     4
e     4     7     2

In [240]:
'var1' in df

True

In [241]:
l = ['var1','var2','var7']

In [242]:
for i in l:
    print(i in df)

True
True
False

In [243]:
df['var1'] is df['var2']

False

In [244]:
df['var1'] # dictionary type choice

b    8
c    9
d    1
e    4
Name: var1, dtype: int32

In [245]:
df.var1 # attribute type choice

b    8
c    9
d    1
e    4
Name: var1, dtype: int32

In [246]:
df[['var1','var2']]

   var1  var2
b     8     8
c     9     6
d     1     9
e     4     7

In [247]:
l = ['var1','var2']
df[l]

   var1  var2
b     8     8
c     9     6
d     1     9
e     4     7

In [248]:
df['added_column'] = df['var1'] / df['var2']
df

   var1  var2  var3  added_column
b     8     8     6      1.000000
c     9     6     6      1.500000
d     1     9     4      0.111111
e     4     7     2      0.571429

In [249]:
df.drop('c',axis=0, inplace=True)

In [250]:
df

   var1  var2  var3  added_column
b     8     8     6      1.000000
d     1     9     4      0.111111
e     4     7     2      0.571429

In [251]:
df.drop('var1', axis=1, inplace=True)

In [252]:
df

   var2  var3  added_column
b     8     6      1.000000
d     9     4      0.111111
e     7     2      0.571429

## Reach to observations and variables

In [253]:
df

   var2  var3  added_column
b     8     6      1.000000
d     9     4      0.111111
e     7     2      0.571429

In [254]:
df.iloc[:3]

   var2  var3  added_column
b     8     6      1.000000
d     9     4      0.111111
e     7     2      0.571429

In [255]:
df.iloc[:2, :2]

   var2  var3
b     8     6
d     9     4

In [256]:
df['var3']

b    6
d    4
e    2
Name: var3, dtype: int32

In [257]:
df.loc[:'e', 'var3']

b    6
d    4
e    2
Name: var3, dtype: int32

In [258]:
df[df.var3 > 4]['var2']

b    8
Name: var2, dtype: int32

In [259]:
df[(df.var3 > 3 & (df.var3 < 2))]['var2'] # conditional index operations

b    8
d    9
e    7
Name: var2, dtype: int32

In [260]:
df.loc[df.var2 > 3, ['added_column']]

   added_column
b      1.000000
d      0.111111
e      0.571429

## Merge - Join Operations

In [261]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)
df = pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     8     1     0
1     3     1     0
2     6     8     8
3     1     3     2
4     1     5     1

In [262]:
df2 = df+99
df2

   var1  var2  var3
0   107   100    99
1   102   100    99
2   105   107   107
3   100   102   101
4   100   104   100

In [263]:
pd.concat([df,df2], axis=0)

   var1  var2  var3
0     8     1     0
1     3     1     0
2     6     8     8
3     1     3     2
4     1     5     1
0   107   100    99
1   102   100    99
2   105   107   107
3   100   102   101
4   100   104   100

In [264]:
pd.concat([df,df2], axis=0, ignore_index=True)

   var1  var2  var3
0     8     1     0
1     3     1     0
2     6     8     8
3     1     3     2
4     1     5     1
5   107   100    99
6   102   100    99
7   105   107   107
8   100   102   101
9   100   104   100

In [265]:
df2.columns= ['var1','var2','v3']
df2

   var1  var2   v3
0   107   100   99
1   102   100   99
2   105   107  107
3   100   102  101
4   100   104  100

In [266]:
pd.concat([df,df2], axis=0, ignore_index=True)

C:\Users\berka\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      v3  var1  var2  var3
0    NaN     8     1   0.0
1    NaN     3     1   0.0
2    NaN     6     8   8.0
3    NaN     1     3   2.0
4    NaN     1     5   1.0
5   99.0   107   100   NaN
6   99.0   102   100   NaN
7  107.0   105   107   NaN
8  101.0   100   102   NaN
9  100.0   100   104   NaN

In [267]:
pd.concat([df,df2], axis=0, join='inner')

   var1  var2
0     8     1
1     3     1
2     6     8
3     1     3
4     1     5
0   107   100
1   102   100
2   105   107
3   100   102
4   100   104

In [268]:
pd.concat([df,df2], join_axes=[df.columns])

C:\Users\berka\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     8     1   0.0
1     3     1   0.0
2     6     8   8.0
3     1     3   2.0
4     1     5   1.0
0   107   100   NaN
1   102   100   NaN
2   105   107   NaN
3   100   102   NaN
4   100   104   NaN

In [269]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'K']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [270]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [271]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [272]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [273]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [274]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'K'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           K  Berkcan

In [275]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           K       2019  Berkcan

In [276]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'K', 'K'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           K      excel
5           K    yonetim

In [277]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           K       2019

In [278]:
pd.merge(df3,df5)

  calisanlar         grup  ilk_giris yetenekler
0        Ali     Muhasebe       2009  matematik
1        Ali     Muhasebe       2009      excel
2       Veli  Muhendislik       2014    kodlama
3       Veli  Muhendislik       2014      linux
4       Ayse  Muhendislik       2010    kodlama
5       Ayse  Muhendislik       2010      linux
6      Fatma           K       2019      excel
7      Fatma           K       2019    yonetim

In [279]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'K', 'K'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           K      excel
5           K    yonetim

In [280]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [281]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           K      excel
7      Fatma           K    yonetim

In [282]:
df3 = pd.DataFrame({'name': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'maas': [70000, 80000, 120000, 90000]})

df3

    name    maas
0    Ali   70000
1   Veli   80000
2   Ayse  120000
3  Fatma   90000

In [283]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           K

In [284]:
pd.merge(df1,df3, left_on='calisanlar', right_on='name').drop('calisanlar', axis=1)

          grup   name    maas
0     Muhasebe    Ali   70000
1  Muhendislik   Veli   80000
2  Muhendislik   Ayse  120000
3           K  Fatma   90000

In [285]:
df3a = df3.set_index('name')
df3a

         maas
name
Ali     70000
Veli    80000
Ayse   120000
Fatma   90000

In [286]:
df3a.shape

(4, 1)

In [287]:
df2a = df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [288]:
pd.merge(df3a, df2a, left_index=True, right_index=True) # intersection df3a<>df2a (there is none)

         maas  ilk_giris
Ali     70000       2009
Veli    80000       2014
Ayse   120000       2010
Fatma   90000       2019

In [289]:
df3a.join(df2a)

         maas  ilk_giris
name
Ali     70000       2009
Veli    80000       2014
Ayse   120000       2010
Fatma   90000       2019

In [290]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [1, 2, 3, 4]})

dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [291]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [3, 1, 4, 2]})

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [292]:
pd.merge(dfa, dfb, on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [293]:
pd.merge(dfa, dfb, on = 'calisanlar', suffixes=['Salary','Experience'])

  calisanlar  siralamaSalary  siralamaExperience
0        Ali               1                   3
1       Veli               2                   1
2       Ayse               3                   4
3      Fatma               4                   2

## Aggregation and Grouping Operations

In [294]:
df = sns.load_dataset('planets')

In [295]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [296]:
df.shape

(1035, 6)

In [297]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [298]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [299]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [300]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [301]:
df = sns.load_dataset('planets')

In [302]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [303]:
df.groupby('method')['orbital_period'].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

## Aggregate, filter, transform, apply

In [304]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [305]:
df.groupby('gruplar').aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [306]:
df.groupby('gruplar').aggregate({'degisken1': min, 'degisken2': max})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [307]:
def filter_func(x):
    return x['degisken1'].std() > 9.5

In [308]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [309]:
df.groupby('gruplar').transform(lambda x:x-x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [310]:
df.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [311]:
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [312]:
L = [0,1,0,1,2,0]

In [313]:
df.groupby(L).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

## Pivot Tables

In [314]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [315]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [316]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [317]:
df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [318]:
df.pivot_table('survived', index='sex', columns='class') # this is simple method by groupby

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [319]:
df.pivot_table('survived', index='sex', columns='class', margins = True) # pivot with margins(All summations)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [320]:
age = pd.cut(df['age'], [0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [321]:
df.pivot_table('survived', ['sex',age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [322]:
fare = pd.qcut(df['fare'],2) # quantile qut
fare.head()

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [323]:
df.pivot_table('survived', ['sex',age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [324]:
df.pivot_table(index = 'sex', columns = 'class', aggfunc = {'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47